###applications
#atom
#chromium
#darktable
#deadbeef
dmenu
#evolution
feh
firefox
#flashplugin
#galculator
#geany
#gimp
#gmrun
#gsimplecal
#guvcview
imagemagick
#inkscape
#libreoffice-fresh
#lshw
#meld
nitrogen
numlockx
#pragha
#qbittorrent
scrot
#simplescreenrecorder
termite
variety
#vlc

###conky
jq
#lm_sensors

###cursors
#xcursor-simpleandsoft

###fonts
adobe-source-sans-fonts
awesome-terminal-fonts
noto-fonts
#ttf-bitstream-vera
ttf-dejavu
ttf-droid
ttf-hack
#ttf-inconsolata
#ttf-liberation
ttf-roboto
ttf-roboto-mono
ttf-ubuntu-font-family

###icons
#arc-icon-theme
#gnome-icon-theme
#papirus-icon-theme

###themes
#adapta-gtk-theme
arc-gtk-theme
arc-darkest-theme-git
kvantum-qt5
#openbox-arc-git

###utilities
arandr
asciinema
bash-completion
#baobab
bat
#catfish
#cronie
dconf-editor
dex
#discord
#dmidecode
duf-bin
edid-decode-git
#evince
expac
file-roller
#filezilla
git
gksu
#glances
gnome-disk-utility
gnome-keyring
#gnome-screenshot
#gnome-software
#gnome-software-packagekit-plugin
gparted
#gpick
#gtop
hardinfo-gtk3
#hddtemp
htop
#hunspell
#hunspell-en_US
hw-probe
#hyphen
#hyphen-en
#grsync
intltool
iw
jsoncpp
libmtp
laptop-detect
lsb-release
mlocate
#nomacs
oh-my-zsh-git
p7zip
pkgfile
#plank
playerctl
polkit
polkit-gnome
#python2-dbus
#python2-xdg
#qt4
qt5ct
#qt5-styleplugins
#qt5-tools
qt5-webkit
#powertop
#redshift
ripgrep
rofi
rxvt-unicode
#simple-scan
#shotwell
speedtest-cli-git
#telegram-desktop
#timeshift
tlp
#tree
#ufw
#gufw
unace
unrar
unzip
#vnstat
w3m
webkit2gtk
wmctrl
xapp
xdo
xdotool
xdg-desktop-portal-gtk
#yt-dlp
#youtube-dl
zenity
zsh
zsh-completions
zsh-syntax-highlighting